[
  {
    "date": "September 24, 2024",
    "title": "'TRICENNIAL YEAR CELEBRATIONS' TECHNICAL TALK SERIES - I",
    "details": "Organized on September 24, 2024, by the EEE Department, PTU, and the IEI Student Chapter, this event celebrated the Tricennial Year with a talk on the GATE exam's significance. The keynote address by Dr. K. Ramakrishnan inspired students towards technical excellence and academic growth.",
    "images":[
        "/images/events/tt1/tti1.png",
        "/images/events/tt1/tti2.png",
        "/images/events/tt1/tti3.png",
        "/images/events/tt1/tti4.png",
        "/images/events/tt1/tti5.png"
    ]
  },
  {
    "date": "October 22, 2024",
    "title": "“TRICENNIAL YEAR CELEBRATIONS” TECHNICAL TALK SERIES - II",
    "details":"Held on October 22, 2024, as part of the Tricennial Year celebrations of the EEE Department, PTU, this event was jointly organized by the EEE Students' Council and the IE(I) Electrical Division. The keynote address by Dr. S. Mohan and an expert talk by Engineer Dinakaran Sesha explored advancements in electrical protection systems, from Electromagnetic Relays to Smart IEDs. Faculty coordinators Dr. Ajay D. Vimal Raj and Dr. N. P. Subramanian, with student support, ensured the event's success. Participants gained valuable insights into cutting-edge technologies in electrical engineering.",
    "images":[
        "/images/events/tt2/tt1.jpg",
        "/images/events/tt2/tt2.jpg",
        "/images/events/tt2/tt3.jpg",
        "/images/events/tt2/tt6.jpeg",
        "/images/events/tt2/tt5.jpg"
    ]
  },
  {
    "date":"November 14, 2024",
    "title":"“WORLD STANDARDS DAY CELEBRATION - 2024” Theme: Shared vision for a better world - Standards for the changing climate",
    "details":"Held on November 14, 2024, at PTU, this event, organized by the EEE Department and IE(I) Student Chapter, centered around the theme 'Shared Vision for a Better World: Standards for the Changing Climate.' Special guest Shri L. Dinesh Rajagopalan discussed BIS standards and their relevance in electrical systems. Competitions like essay writing and digital poster designing added excitement, with winners receiving prizes and certificates.",
    "images":[
        "/images/events/wsd/wsd1.png",
        "/images/events/wsd/wsd2.png",
        "/images/events/wsd/wsd3.png",
        "/images/events/wsd/wsd4.png",
        "/images/events/wsd/wsd5.png"
    ]
  }
]
